koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* SPICON[CPOL] - Serial Clock Polarity */
#define SPICON_CPOL_MSK                (0x1   << 3  )
#define SPICON_CPOL                    (0x1   << 3  )
#define SPICON_CPOL_LOW                (0x0   << 3  ) /* Serial clock idles low   */
#define SPICON_CPOL_HIGH               (0x1   << 3  ) /* Serial clock idles high  */

/* SPICON[CPHA] - Serial clock phase mode */
#define SPICON_CPHA_MSK                (0x1   << 2  )
#define SPICON_CPHA                    (0x1   << 2  )
#define SPICON_CPHA_SAMPLETRAILING     (0x1   << 2  ) /* Serial clock pulses at the beginning of each serial bit transfer */
#define SPICON_CPHA_SAMPLELEADING      (0x0   << 2  ) /* Serial clock pulses at the end of each serial bit transfer */

/* SPICON[MASEN] - Master mode enable */
#define SPICON_MASEN_MSK               (0x1   << 1  )
#define SPICON_MASEN                   (0x1   << 1  )
#define SPICON_MASEN_DIS               (0x0   << 1  ) /* Enable slave mode        */
#define SPICON_MASEN_EN                (0x1   << 1  ) /* Enable master mode       */

/* SPICON[ENABLE] - SPI enable */
#define SPICON_ENABLE_MSK              (0x1   << 0  )
#define SPICON_ENABLE                  (0x1   << 0  )
#define SPICON_ENABLE_DIS              (0x0   << 0  ) /* Disable the SPI          */
#define SPICON_ENABLE_EN               (0x1   << 0  ) /* Enable the SPI           */

/* SPIDMA[IENRXDMA] - Enable receive DMA request */
#define SPIDMA_IENRXDMA_MSK            (0x1   << 2  )
#define SPIDMA_IENRXDMA                (0x1   << 2  )
#define SPIDMA_IENRXDMA_DIS            (0x0   << 2  ) /* Disable RX DMA Interrupt */
#define SPIDMA_IENRXDMA_EN             (0x1   << 2  ) /* Enable RX DMA Interrupt  */

/* SPIDMA[IENTXDMA] - Enable transmit DMA request */
#define SPIDMA_IENTXDMA_MSK            (0x1   << 1  )
#define SPIDMA_IENTXDMA                (0x1   << 1  )
#define SPIDMA_IENTXDMA_DIS            (0x0   << 1  ) /* Disable TX DMA Interrupt */
#define SPIDMA_IENTXDMA_EN             (0x1   << 1  ) /* Enable TX DMA Interrupt  */

/* SPIDMA[ENABLE] - Enable DMA for data transfer */
#define SPIDMA_ENABLE_MSK              (0x1   << 0  )
#define SPIDMA_ENABLE                  (0x1   << 0  )
#define SPIDMA_ENABLE_DIS              (0x0   << 0  )
#define SPIDMA_ENABLE_EN               (0x1   << 0  )

/* SPICNT[COUNT] - Transfer byte count */
#define SPICNT_COUNT_MSK               (0xFF  << 0  )

/* I2CMCON[PRESTOP_BUS_CLR] - Prestop Bus-Clear */
#define I2CMCON_PRESTOP_BUS_CLR_MSK    (0x1   << 13 )
#define I2CMCON_PRESTOP_BUS_CLR        (0x1   << 13 )
#define I2CMCON_PRESTOP_BUS_CLR_DIS    (0x0   << 13 )
#define I2CMCON_PRESTOP_BUS_CLR_EN     (0x1   << 13 )

/* I2CMCON[BUS_CLR_EN] - Bus-Clear Enable */
#define I2CMCON_BUS_CLR_EN_MSK         (0x1   << 12 )
#define I2CMCON_BUS_CLR_EN             (0x1   << 12 )
#define I2CMCON_BUS_CLR_EN_DIS         (0x0   << 12 )
#define I2CMCON_BUS_CLR_EN_EN          (0x1   << 12 )

/* I2CMCON[MTXDMA] - Enable master Tx DMA request */
#define I2CMCON_MTXDMA_MSK             (0x1   << 11 )
#define I2CMCON_MTXDMA                 (0x1   << 11 )
#define I2CMCON_MTXDMA_DIS             (0x0   << 11 ) /* Disable DMA mode         */
#define I2CMCON_MTXDMA_EN              (0x1   << 11 ) /* Enable I2C master DMA Tx requests. */

/* I2CMCON[MRXDMA] - Enable master Rx DMA request */
#define I2CMCON_MRXDMA_MSK             (0x1   << 10 )
#define I2CMCON_MRXDMA                 (0x1   << 10 )
#define I2CMCON_MRXDMA_DIS             (0x0   << 10 ) /* Disable DMA mode         */
#define I2CMCON_MRXDMA_EN              (0x1   << 10 ) /* Enable I2C master DMA Rx requests. */

/* I2CMCON[MXMITDEC] - Decrement master TX FIFO status when a byte has been transmitted */
#define I2CMCON_MXMITDEC_MSK           (0x1   << 9  )
#define I2CMCON_MXMITDEC               (0x1   << 9  )
#define I2CMCON_MXMITDEC_DIS           (0x0   << 9  )
#define I2CMCON_MXMITDEC_EN            (0x1   << 9  )

/* I2CMCON[IENCMP] - Transaction completed (or stop detected) interrupt enable */
#define I2CMCON_IENCMP_MSK             (0x1   << 8  )
#define I2CMCON_IENCMP                 (0x1   << 8  )
#define I2CMCON_IENCMP_DIS             (0x0   << 8  ) /* An interrupt is not generated when a STOP is detected. */
#define I2CMCON_IENCMP_EN              (0x1   << 8  ) /* An interrupt is generated when a STOP is detected. */

/* I2CMCON[IENACK] - ACK not received interrupt enable */
#define I2CMCON_IENACK_MSK             (0x1   << 7  )
#define I2CMCON_IENACK                 (0x1   << 7  )
#define I2CMCON_IENACK_DIS             (0x0   << 7  ) /* ACK not received interrupt disable */
#define I2CMCON_IENACK_EN              (0x1   << 7  ) /* ACK not received interrupt enable */

/* I2CMCON[IENALOST] - Arbitration lost interrupt enable */
#define I2CMCON_IENALOST_MSK           (0x1   << 6  )
#define I2CMCON_IENALOST               (0x1   << 6  )
#define I2CMCON_IENALOST_DIS           (0x0   << 6  ) /* Arbitration lost interrupt disable */
#define I2CMCON_IENALOST_EN            (0x1   << 6  ) /* Arbitration lost interrupt enable */

/* I2CMCON[IENMTX] - Transmit request interrupt enable */
#define I2CMCON_IENMTX_MSK             (0x1   << 5  )
#define I2CMCON_IENMTX                 (0x1   << 5  )
#define I2CMCON_IENMTX_DIS             (0x0   << 5  ) /* Transmit request interrupt disable */
#define I2CMCON_IENMTX_EN              (0x1   << 5  ) /* Transmit request interrupt enable */

/* I2CMCON[IENMRX] - Receive request interrupt enable */
#define I2CMCON_IENMRX_MSK             (0x1   << 4  )
#define I2CMCON_IENMRX                 (0x1   << 4  )
#define I2CMCON_IENMRX_DIS             (0x0   << 4  ) /* Receive request interrupt disable */
#define I2CMCON_IENMRX_EN              (0x1   << 4  ) /* Receive request interrupt enable */

/* I2CMCON[STRETCH] - Stretch SCL enable */
#define I2CMCON_STRETCH_MSK            (0x1   << 3  )
#define I2CMCON_STRETCH                (0x1   << 3  )
#define I2CMCON_STRETCH_DIS            (0x0   << 3  ) /* Disable Clock stretching */
#define I2CMCON_STRETCH_EN             (0x1   << 3  ) /* Setting this bit tells the device if SCL is 0 hold it at 0;. Or if SCL is 1 then when it next goes to 0 hold it at 0. */

