koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* T1STA[CAP] - Capture event pending */
#define T1STA_CAP_BBA                  (*(volatile unsigned long *) 0x42008384)
#define T1STA_CAP_MSK                  (0x1   << 1  )
#define T1STA_CAP                      (0x1   << 1  )
#define T1STA_CAP_CLR                  (0x0   << 1  ) /* CLR. No capture event is pending */
#define T1STA_CAP_SET                  (0x1   << 1  ) /* SET. A capture event is pending */

/* T1STA[TMOUT] - Timeout event occurred */
#define T1STA_TMOUT_BBA                (*(volatile unsigned long *) 0x42008380)
#define T1STA_TMOUT_MSK                (0x1   << 0  )
#define T1STA_TMOUT                    (0x1   << 0  )
#define T1STA_TMOUT_CLR                (0x0   << 0  ) /* CLR. No timeout event has occurred */
#define T1STA_TMOUT_SET                (0x1   << 0  ) /* SET. A timeout event has occurred */

/* Reset Value for T2LD*/
#define T2LD_RVAL                      0x0 

/* T2LD[LOAD] - Load value */
#define T2LD_LOAD_MSK                  (0xFFFF << 0  )

/* Reset Value for T2VAL*/
#define T2VAL_RVAL                     0x0 

/* T2VAL[VAL] - Current count */
#define T2VAL_VAL_MSK                  (0xFFFF << 0  )

/* Reset Value for T2CON*/
#define T2CON_RVAL                     0xA 

/* T2CON[EVENTEN] - Event select */
#define T2CON_EVENTEN_BBA              (*(volatile unsigned long *) 0x42010130)
#define T2CON_EVENTEN_MSK              (0x1   << 12 )
#define T2CON_EVENTEN                  (0x1   << 12 )
#define T2CON_EVENTEN_DIS              (0x0   << 12 ) /* Events will not be captured */
#define T2CON_EVENTEN_EN               (0x1   << 12 ) /* Events will be captured  */

/* T2CON[EVENT] - Event select range */
#define T2CON_EVENT_MSK                (0xF   << 8  )

/* T2CON[RLD] - Reload control */
#define T2CON_RLD_BBA                  (*(volatile unsigned long *) 0x4201011C)
#define T2CON_RLD_MSK                  (0x1   << 7  )
#define T2CON_RLD                      (0x1   << 7  )
#define T2CON_RLD_EN                   (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define T2CON_RLD_DIS                  (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* T2CON[CLK] - Clock select */
#define T2CON_CLK_MSK                  (0x3   << 5  )
#define T2CON_CLK_PCLK                 (0x0   << 5  ) /* PCLK                     */
#define T2CON_CLK_HCLK                 (0x1   << 5  ) /* HCLK                     */
#define T2CON_CLK_LFOSC                (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define T2CON_CLK_HFXTAL               (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* T2CON[ENABLE] - Timer enable */
#define T2CON_ENABLE_BBA               (*(volatile unsigned long *) 0x42010110)
#define T2CON_ENABLE_MSK               (0x1   << 4  )
#define T2CON_ENABLE                   (0x1   << 4  )
#define T2CON_ENABLE_DIS               (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define T2CON_ENABLE_EN                (0x1   << 4  ) /* EN. Timer is enabled     */

/* T2CON[MOD] - Timer mode */
#define T2CON_MOD_BBA                  (*(volatile unsigned long *) 0x4201010C)
#define T2CON_MOD_MSK                  (0x1   << 3  )
#define T2CON_MOD                      (0x1   << 3  )
#define T2CON_MOD_FREERUN              (0x0   << 3  ) /* FREERUN. Timer runs in free running mode */
#define T2CON_MOD_PERIODIC             (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

/* T2CON[UP] - Count up */
#define T2CON_UP_BBA                   (*(volatile unsigned long *) 0x42010108)
#define T2CON_UP_MSK                   (0x1   << 2  )
#define T2CON_UP                       (0x1   << 2  )
#define T2CON_UP_DIS                   (0x0   << 2  ) /* DIS. Timer is set to count down (default) */
#define T2CON_UP_EN                    (0x1   << 2  ) /* EN. Timer is set to count up */

/* T2CON[PRE] - Prescaler */
#define T2CON_PRE_MSK                  (0x3   << 0  )
#define T2CON_PRE_DIV1                 (0x0   << 0  ) /* source_clock / [1 or 4]  */
#define T2CON_PRE_DIV16                (0x1   << 0  ) /* source_clock / 16        */
#define T2CON_PRE_DIV256               (0x2   << 0  ) /* source_clock / 256       */
#define T2CON_PRE_DIV32768             (0x3   << 0  ) /* source_clock / 32,768    */

/* Reset Value for T2CLRI*/
#define T2CLRI_RVAL                    0x0 

/* T2CLRI[CAP] - Clear captured event interrupt */
#define T2CLRI_CAP_BBA                 (*(volatile unsigned long *) 0x42010184)
#define T2CLRI_CAP_MSK                 (0x1   << 1  )
#define T2CLRI_CAP                     (0x1   << 1  )
#define T2CLRI_CAP_CLR                 (0x1   << 1  ) /* Clear the capture event interrupt */

/* T2CLRI[TMOUT] - Clear timeout interrupt */
#define T2CLRI_TMOUT_BBA               (*(volatile unsigned long *) 0x42010180)
#define T2CLRI_TMOUT_MSK               (0x1   << 0  )
#define T2CLRI_TMOUT                   (0x1   << 0  )
#define T2CLRI_TMOUT_CLR               (0x1   << 0  ) /* Clears the timeout interrupt */

/* Reset Value for T2CAP*/
#define T2CAP_RVAL                     0x0 

/* T2CAP[CAP] - 16-bit captured value */
#define T2CAP_CAP_MSK                  (0xFFFF << 0  )

/* Reset Value for T2STA*/
#define T2STA_RVAL                     0x0 

/* T2STA[PDOK] - TCLRI synchronization */
#define T2STA_PDOK_BBA                 (*(volatile unsigned long *) 0x4201039C)
#define T2STA_PDOK_MSK                 (0x1   << 7  )
#define T2STA_PDOK                     (0x1   << 7  )
#define T2STA_PDOK_CLR                 (0x0   << 7  ) /* CLR. The interrupt is cleared in the timer clock domain */
#define T2STA_PDOK_SET                 (0x1   << 7  ) /* SET. TCLRI[0] is being updated in the timer clock domain */

/* T2STA[BUSY] - Timer Busy */
#define T2STA_BUSY_BBA                 (*(volatile unsigned long *) 0x42010398)
#define T2STA_BUSY_MSK                 (0x1   << 6  )
#define T2STA_BUSY                     (0x1   << 6  )
#define T2STA_BUSY_CLR                 (0x0   << 6  ) /* CLR. Timer ready to receive commands to TCON */
#define T2STA_BUSY_SET                 (0x1   << 6  ) /* SET. Timer not ready to receive commands to TCON */

/* T2STA[CAP] - Capture event pending */
#define T2STA_CAP_BBA                  (*(volatile unsigned long *) 0x42010384)
#define T2STA_CAP_MSK                  (0x1   << 1  )
#define T2STA_CAP                      (0x1   << 1  )
#define T2STA_CAP_CLR                  (0x0   << 1  ) /* CLR. No capture event is pending */
#define T2STA_CAP_SET                  (0x1   << 1  ) /* SET. A capture event is pending */

