koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* EICLR[IRQ7] - External interrupt 7 */
#define EICLR_IRQ7_BBA                 (*(volatile unsigned long *) 0x4204861C)
#define EICLR_IRQ7_MSK                 (0x1   << 7  )
#define EICLR_IRQ7                     (0x1   << 7  )
#define EICLR_IRQ7_DIS                 (0x0   << 7  )
#define EICLR_IRQ7_EN                  (0x1   << 7  )

/* EICLR[IRQ6] - External interrupt 6 */
#define EICLR_IRQ6_BBA                 (*(volatile unsigned long *) 0x42048618)
#define EICLR_IRQ6_MSK                 (0x1   << 6  )
#define EICLR_IRQ6                     (0x1   << 6  )
#define EICLR_IRQ6_DIS                 (0x0   << 6  )
#define EICLR_IRQ6_EN                  (0x1   << 6  )

/* EICLR[IRQ5] - External interrupt 5 */
#define EICLR_IRQ5_BBA                 (*(volatile unsigned long *) 0x42048614)
#define EICLR_IRQ5_MSK                 (0x1   << 5  )
#define EICLR_IRQ5                     (0x1   << 5  )
#define EICLR_IRQ5_DIS                 (0x0   << 5  )
#define EICLR_IRQ5_EN                  (0x1   << 5  )

/* EICLR[IRQ4] - External interrupt 4 */
#define EICLR_IRQ4_BBA                 (*(volatile unsigned long *) 0x42048610)
#define EICLR_IRQ4_MSK                 (0x1   << 4  )
#define EICLR_IRQ4                     (0x1   << 4  )
#define EICLR_IRQ4_DIS                 (0x0   << 4  )
#define EICLR_IRQ4_EN                  (0x1   << 4  )

/* EICLR[IRQ3] - External interrupt 3 */
#define EICLR_IRQ3_BBA                 (*(volatile unsigned long *) 0x4204860C)
#define EICLR_IRQ3_MSK                 (0x1   << 3  )
#define EICLR_IRQ3                     (0x1   << 3  )
#define EICLR_IRQ3_DIS                 (0x0   << 3  )
#define EICLR_IRQ3_EN                  (0x1   << 3  )

/* EICLR[IRQ2] - External interrupt 2 */
#define EICLR_IRQ2_BBA                 (*(volatile unsigned long *) 0x42048608)
#define EICLR_IRQ2_MSK                 (0x1   << 2  )
#define EICLR_IRQ2                     (0x1   << 2  )
#define EICLR_IRQ2_DIS                 (0x0   << 2  )
#define EICLR_IRQ2_EN                  (0x1   << 2  )

/* EICLR[IRQ1] - External interrupt 1 */
#define EICLR_IRQ1_BBA                 (*(volatile unsigned long *) 0x42048604)
#define EICLR_IRQ1_MSK                 (0x1   << 1  )
#define EICLR_IRQ1                     (0x1   << 1  )
#define EICLR_IRQ1_DIS                 (0x0   << 1  )
#define EICLR_IRQ1_EN                  (0x1   << 1  )

/* EICLR[IRQ0] - External interrupt 0 */
#define EICLR_IRQ0_BBA                 (*(volatile unsigned long *) 0x42048600)
#define EICLR_IRQ0_MSK                 (0x1   << 0  )
#define EICLR_IRQ0                     (0x1   << 0  )
#define EICLR_IRQ0_DIS                 (0x0   << 0  )
#define EICLR_IRQ0_EN                  (0x1   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        wdt                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief wdt (pADI_WDT)
  */

typedef struct {                            /*!< pADI_WDT Structure                     */
  __IO uint16_t  T3LD;                      /*!< Load value register                   */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T3VAL;                     /*!< Current count value register          */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T3CON;                     /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T3CLRI;                    /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED3[5];
  __IO uint16_t  T3STA;                     /*!< Status register                       */
} ADI_WDT_TypeDef;

/* Reset Value for T3LD*/
#define T3LD_RVAL                      0x1000 

/* T3LD[LOAD] - Load value */
#define T3LD_LOAD_MSK                  (0xFFFF << 0  )

/* Reset Value for T3VAL*/
#define T3VAL_RVAL                     0x1000 

/* T3VAL[CCOUNT] - Current count value */
#define T3VAL_CCOUNT_MSK               (0xFFFF << 0  )

/* Reset Value for T3CON*/
#define T3CON_RVAL                     0xE9 

/* T3CON[MOD] - Timer mode */
#define T3CON_MOD_BBA                  (*(volatile unsigned long *) 0x4204B118)
#define T3CON_MOD_MSK                  (0x1   << 6  )
#define T3CON_MOD                      (0x1   << 6  )
#define T3CON_MOD_FREERUN              (0x0   << 6  ) /* FREERUN. Cleared by user to operate in free running mode. */
#define T3CON_MOD_PERIODIC             (0x1   << 6  ) /* PERIODIC. Set by user to operate in periodic mode (default). */

/* T3CON[ENABLE] - Timer enable */
#define T3CON_ENABLE_BBA               (*(volatile unsigned long *) 0x4204B114)
#define T3CON_ENABLE_MSK               (0x1   << 5  )
#define T3CON_ENABLE                   (0x1   << 5  )
#define T3CON_ENABLE_DIS               (0x0   << 5  ) /* DIS. Cleared by user to disable the timer. */
#define T3CON_ENABLE_EN                (0x1   << 5  ) /* EN. Set by user to enable the timer (default). */

/* T3CON[PRE] - Prescaler */
#define T3CON_PRE_MSK                  (0x3   << 2  )
#define T3CON_PRE_DIV1                 (0x0   << 2  ) /* DIV1.Source clock/1.     */
#define T3CON_PRE_DIV16                (0x1   << 2  ) /* DIV16. Source clock/16.  */
#define T3CON_PRE_DIV256               (0x2   << 2  ) /* DIV256. Source clock/256 (default). */
#define T3CON_PRE_DIV4096              (0x3   << 2  ) /* DIV4096. Source clock/4096 */

/* T3CON[IRQ] - Timer interrupt */
#define T3CON_IRQ_BBA                  (*(volatile unsigned long *) 0x4204B104)
#define T3CON_IRQ_MSK                  (0x1   << 1  )
#define T3CON_IRQ                      (0x1   << 1  )
#define T3CON_IRQ_DIS                  (0x0   << 1  ) /* DIS.Cleared by user to generate a reset on a time out (default). */
#define T3CON_IRQ_EN                   (0x1   << 1  ) /* EN.Set by user to generate an interrupt when the timer times out. This feature is provided for debug purposes and is only available in ACTIVE mode. */

