koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* I2C0MSTA[MSTOP] - STOP driven by this I2C Master */
#define I2C0MSTA_MSTOP_BBA             (*(volatile unsigned long *) 0x420600AC)
#define I2C0MSTA_MSTOP_MSK             (0x1   << 11 )
#define I2C0MSTA_MSTOP                 (0x1   << 11 )
#define I2C0MSTA_MSTOP_CLR             (0x0   << 11 )
#define I2C0MSTA_MSTOP_SET             (0x1   << 11 )

/* I2C0MSTA[LINEBUSY] - Line is busy */
#define I2C0MSTA_LINEBUSY_BBA          (*(volatile unsigned long *) 0x420600A8)
#define I2C0MSTA_LINEBUSY_MSK          (0x1   << 10 )
#define I2C0MSTA_LINEBUSY              (0x1   << 10 )
#define I2C0MSTA_LINEBUSY_CLR          (0x0   << 10 )
#define I2C0MSTA_LINEBUSY_SET          (0x1   << 10 )

/* I2C0MSTA[MRXOF] - Master Receive FIFO overflow */
#define I2C0MSTA_MRXOF_BBA             (*(volatile unsigned long *) 0x420600A4)
#define I2C0MSTA_MRXOF_MSK             (0x1   << 9  )
#define I2C0MSTA_MRXOF                 (0x1   << 9  )
#define I2C0MSTA_MRXOF_CLR             (0x0   << 9  )
#define I2C0MSTA_MRXOF_SET             (0x1   << 9  )

/* I2C0MSTA[TCOMP] - Transaction complete or stop detected */
#define I2C0MSTA_TCOMP_BBA             (*(volatile unsigned long *) 0x420600A0)
#define I2C0MSTA_TCOMP_MSK             (0x1   << 8  )
#define I2C0MSTA_TCOMP                 (0x1   << 8  )
#define I2C0MSTA_TCOMP_CLR             (0x0   << 8  )
#define I2C0MSTA_TCOMP_SET             (0x1   << 8  )

/* I2C0MSTA[NACKDATA] - ACK not received in response to data write */
#define I2C0MSTA_NACKDATA_BBA          (*(volatile unsigned long *) 0x4206009C)
#define I2C0MSTA_NACKDATA_MSK          (0x1   << 7  )
#define I2C0MSTA_NACKDATA              (0x1   << 7  )
#define I2C0MSTA_NACKDATA_CLR          (0x0   << 7  )
#define I2C0MSTA_NACKDATA_SET          (0x1   << 7  )

/* I2C0MSTA[MBUSY] - Master busy */
#define I2C0MSTA_MBUSY_BBA             (*(volatile unsigned long *) 0x42060098)
#define I2C0MSTA_MBUSY_MSK             (0x1   << 6  )
#define I2C0MSTA_MBUSY                 (0x1   << 6  )
#define I2C0MSTA_MBUSY_CLR             (0x0   << 6  )
#define I2C0MSTA_MBUSY_SET             (0x1   << 6  )

/* I2C0MSTA[ALOST] - Arbitration lost */
#define I2C0MSTA_ALOST_BBA             (*(volatile unsigned long *) 0x42060094)
#define I2C0MSTA_ALOST_MSK             (0x1   << 5  )
#define I2C0MSTA_ALOST                 (0x1   << 5  )
#define I2C0MSTA_ALOST_CLR             (0x0   << 5  )
#define I2C0MSTA_ALOST_SET             (0x1   << 5  )

/* I2C0MSTA[NACKADDR] - ACK not received in response to an address */
#define I2C0MSTA_NACKADDR_BBA          (*(volatile unsigned long *) 0x42060090)
#define I2C0MSTA_NACKADDR_MSK          (0x1   << 4  )
#define I2C0MSTA_NACKADDR              (0x1   << 4  )
#define I2C0MSTA_NACKADDR_CLR          (0x0   << 4  )
#define I2C0MSTA_NACKADDR_SET          (0x1   << 4  )

/* I2C0MSTA[MRXREQ] - Master Receive request */
#define I2C0MSTA_MRXREQ_BBA            (*(volatile unsigned long *) 0x4206008C)
#define I2C0MSTA_MRXREQ_MSK            (0x1   << 3  )
#define I2C0MSTA_MRXREQ                (0x1   << 3  )
#define I2C0MSTA_MRXREQ_CLR            (0x0   << 3  )
#define I2C0MSTA_MRXREQ_SET            (0x1   << 3  )

/* I2C0MSTA[MTXREQ] - Master Transmit request */
#define I2C0MSTA_MTXREQ_BBA            (*(volatile unsigned long *) 0x42060088)
#define I2C0MSTA_MTXREQ_MSK            (0x1   << 2  )
#define I2C0MSTA_MTXREQ                (0x1   << 2  )
#define I2C0MSTA_MTXREQ_CLR            (0x0   << 2  )
#define I2C0MSTA_MTXREQ_SET            (0x1   << 2  )

/* I2C0MSTA[MTXFSTA] - Master Transmit FIFO status */
#define I2C0MSTA_MTXFSTA_MSK           (0x3   << 0  )

/* Reset Value for I2C0MRX*/
#define I2C0MRX_RVAL                   0x0 

/* I2C0MRX[ICMRX] - Master receive register */
#define I2C0MRX_ICMRX_MSK              (0xFF  << 0  )

/* Reset Value for I2C0MTX*/
#define I2C0MTX_RVAL                   0x0 

/* I2C0MTX[I2CMTX] - Master transmit register */
#define I2C0MTX_I2CMTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C0MRXCNT*/
#define I2C0MRXCNT_RVAL                0x0 

/* I2C0MRXCNT[EXTEND] - Extended read */
#define I2C0MRXCNT_EXTEND_BBA          (*(volatile unsigned long *) 0x42060220)
#define I2C0MRXCNT_EXTEND_MSK          (0x1   << 8  )
#define I2C0MRXCNT_EXTEND              (0x1   << 8  )
#define I2C0MRXCNT_EXTEND_DIS          (0x0   << 8  )
#define I2C0MRXCNT_EXTEND_EN           (0x1   << 8  )

/* I2C0MRXCNT[COUNT] - Receive count */
#define I2C0MRXCNT_COUNT_MSK           (0xFF  << 0  )

/* Reset Value for I2C0MCRXCNT*/
#define I2C0MCRXCNT_RVAL               0x0 

/* I2C0MCRXCNT[COUNT] - Current receive count */
#define I2C0MCRXCNT_COUNT_MSK          (0xFF  << 0  )

/* Reset Value for I2C0ADR0*/
#define I2C0ADR0_RVAL                  0x0 

/* I2C0ADR0[ADR0] - Address byte 0 */
#define I2C0ADR0_ADR0_MSK              (0xFF  << 0  )

/* Reset Value for I2C0ADR1*/
#define I2C0ADR1_RVAL                  0x0 

/* I2C0ADR1[ADR1] - Address byte 1 */
#define I2C0ADR1_ADR1_MSK              (0xFF  << 0  )

/* Reset Value for I2C0DIV*/
#define I2C0DIV_RVAL                   0x1F1F 

/* I2C0DIV[HIGH] - Serial clock high time */
#define I2C0DIV_HIGH_MSK               (0xFF  << 8  )

/* I2C0DIV[LOW] - Serial clock low time */
#define I2C0DIV_LOW_MSK                (0xFF  << 0  )

/* Reset Value for I2C0SCON*/
#define I2C0SCON_RVAL                  0x0 

/* I2C0SCON[STXDMA] - Enable slave Tx DMA request */
#define I2C0SCON_STXDMA_BBA            (*(volatile unsigned long *) 0x42060538)
#define I2C0SCON_STXDMA_MSK            (0x1   << 14 )
#define I2C0SCON_STXDMA                (0x1   << 14 )
#define I2C0SCON_STXDMA_DIS            (0x0   << 14 )
#define I2C0SCON_STXDMA_EN             (0x1   << 14 )

/* I2C0SCON[SRXDMA] - Enable slave Rx DMA request */
#define I2C0SCON_SRXDMA_BBA            (*(volatile unsigned long *) 0x42060534)
#define I2C0SCON_SRXDMA_MSK            (0x1   << 13 )
#define I2C0SCON_SRXDMA                (0x1   << 13 )
#define I2C0SCON_SRXDMA_DIS            (0x0   << 13 )
#define I2C0SCON_SRXDMA_EN             (0x1   << 13 )

/* I2C0SCON[IENREPST] - Repeated start interrupt enable */
#define I2C0SCON_IENREPST_BBA          (*(volatile unsigned long *) 0x42060530)
#define I2C0SCON_IENREPST_MSK          (0x1   << 12 )
#define I2C0SCON_IENREPST              (0x1   << 12 )
#define I2C0SCON_IENREPST_DIS          (0x0   << 12 )
#define I2C0SCON_IENREPST_EN           (0x1   << 12 )

/* I2C0SCON[SXMITDEC] - Decrement Slave Tx FIFO status when a byte has been transmitted */
#define I2C0SCON_SXMITDEC_BBA          (*(volatile unsigned long *) 0x4206052C)
#define I2C0SCON_SXMITDEC_MSK          (0x1   << 11 )
#define I2C0SCON_SXMITDEC              (0x1   << 11 )
#define I2C0SCON_SXMITDEC_DIS          (0x0   << 11 )
#define I2C0SCON_SXMITDEC_EN           (0x1   << 11 )

/* I2C0SCON[IENSTX] - Slave Transmit request interrupt enable */
#define I2C0SCON_IENSTX_BBA            (*(volatile unsigned long *) 0x42060528)
#define I2C0SCON_IENSTX_MSK            (0x1   << 10 )
#define I2C0SCON_IENSTX                (0x1   << 10 )
#define I2C0SCON_IENSTX_DIS            (0x0   << 10 )
#define I2C0SCON_IENSTX_EN             (0x1   << 10 )

