koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* I2C1MSTA[MTXFSTA] - Master Transmit FIFO status */
#define I2C1MSTA_MTXFSTA_MSK           (0x3   << 0  )

/* Reset Value for I2C1MRX*/
#define I2C1MRX_RVAL                   0x0 

/* I2C1MRX[ICMRX] - Master receive register */
#define I2C1MRX_ICMRX_MSK              (0xFF  << 0  )

/* Reset Value for I2C1MTX*/
#define I2C1MTX_RVAL                   0x0 

/* I2C1MTX[I2CMTX] - Master transmit register */
#define I2C1MTX_I2CMTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1MRXCNT*/
#define I2C1MRXCNT_RVAL                0x0 

/* I2C1MRXCNT[EXTEND] - Extended read */
#define I2C1MRXCNT_EXTEND_BBA          (*(volatile unsigned long *) 0x42068220)
#define I2C1MRXCNT_EXTEND_MSK          (0x1   << 8  )
#define I2C1MRXCNT_EXTEND              (0x1   << 8  )
#define I2C1MRXCNT_EXTEND_DIS          (0x0   << 8  )
#define I2C1MRXCNT_EXTEND_EN           (0x1   << 8  )

/* I2C1MRXCNT[COUNT] - Receive count */
#define I2C1MRXCNT_COUNT_MSK           (0xFF  << 0  )

/* Reset Value for I2C1MCRXCNT*/
#define I2C1MCRXCNT_RVAL               0x0 

/* I2C1MCRXCNT[COUNT] - Current receive count */
#define I2C1MCRXCNT_COUNT_MSK          (0xFF  << 0  )

/* Reset Value for I2C1ADR0*/
#define I2C1ADR0_RVAL                  0x0 

/* I2C1ADR0[ADR0] - Address byte 0 */
#define I2C1ADR0_ADR0_MSK              (0xFF  << 0  )

/* Reset Value for I2C1ADR1*/
#define I2C1ADR1_RVAL                  0x0 

/* I2C1ADR1[ADR1] - Address byte 1 */
#define I2C1ADR1_ADR1_MSK              (0xFF  << 0  )

/* Reset Value for I2C1DIV*/
#define I2C1DIV_RVAL                   0x1F1F 

/* I2C1DIV[HIGH] - Serial clock high time */
#define I2C1DIV_HIGH_MSK               (0xFF  << 8  )

/* I2C1DIV[LOW] - Serial clock low time */
#define I2C1DIV_LOW_MSK                (0xFF  << 0  )

/* Reset Value for I2C1SCON*/
#define I2C1SCON_RVAL                  0x0 

/* I2C1SCON[STXDMA] - Enable slave Tx DMA request */
#define I2C1SCON_STXDMA_BBA            (*(volatile unsigned long *) 0x42068538)
#define I2C1SCON_STXDMA_MSK            (0x1   << 14 )
#define I2C1SCON_STXDMA                (0x1   << 14 )
#define I2C1SCON_STXDMA_DIS            (0x0   << 14 )
#define I2C1SCON_STXDMA_EN             (0x1   << 14 )

/* I2C1SCON[SRXDMA] - Enable slave Rx DMA request */
#define I2C1SCON_SRXDMA_BBA            (*(volatile unsigned long *) 0x42068534)
#define I2C1SCON_SRXDMA_MSK            (0x1   << 13 )
#define I2C1SCON_SRXDMA                (0x1   << 13 )
#define I2C1SCON_SRXDMA_DIS            (0x0   << 13 )
#define I2C1SCON_SRXDMA_EN             (0x1   << 13 )

/* I2C1SCON[IENREPST] - Repeated start interrupt enable */
#define I2C1SCON_IENREPST_BBA          (*(volatile unsigned long *) 0x42068530)
#define I2C1SCON_IENREPST_MSK          (0x1   << 12 )
#define I2C1SCON_IENREPST              (0x1   << 12 )
#define I2C1SCON_IENREPST_DIS          (0x0   << 12 )
#define I2C1SCON_IENREPST_EN           (0x1   << 12 )

/* I2C1SCON[SXMITDEC] - Decrement Slave Tx FIFO status when a byte has been transmitted */
#define I2C1SCON_SXMITDEC_BBA          (*(volatile unsigned long *) 0x4206852C)
#define I2C1SCON_SXMITDEC_MSK          (0x1   << 11 )
#define I2C1SCON_SXMITDEC              (0x1   << 11 )
#define I2C1SCON_SXMITDEC_DIS          (0x0   << 11 )
#define I2C1SCON_SXMITDEC_EN           (0x1   << 11 )

/* I2C1SCON[IENSTX] - Slave Transmit request interrupt enable */
#define I2C1SCON_IENSTX_BBA            (*(volatile unsigned long *) 0x42068528)
#define I2C1SCON_IENSTX_MSK            (0x1   << 10 )
#define I2C1SCON_IENSTX                (0x1   << 10 )
#define I2C1SCON_IENSTX_DIS            (0x0   << 10 )
#define I2C1SCON_IENSTX_EN             (0x1   << 10 )

/* I2C1SCON[IENSRX] - Slave Receive request interrupt enable */
#define I2C1SCON_IENSRX_BBA            (*(volatile unsigned long *) 0x42068524)
#define I2C1SCON_IENSRX_MSK            (0x1   << 9  )
#define I2C1SCON_IENSRX                (0x1   << 9  )
#define I2C1SCON_IENSRX_DIS            (0x0   << 9  )
#define I2C1SCON_IENSRX_EN             (0x1   << 9  )

/* I2C1SCON[IENSTOP] - Stop condition detected interrupt enable */
#define I2C1SCON_IENSTOP_BBA           (*(volatile unsigned long *) 0x42068520)
#define I2C1SCON_IENSTOP_MSK           (0x1   << 8  )
#define I2C1SCON_IENSTOP               (0x1   << 8  )
#define I2C1SCON_IENSTOP_DIS           (0x0   << 8  )
#define I2C1SCON_IENSTOP_EN            (0x1   << 8  )

/* I2C1SCON[NACK] - NACK next communication */
#define I2C1SCON_NACK_BBA              (*(volatile unsigned long *) 0x4206851C)
#define I2C1SCON_NACK_MSK              (0x1   << 7  )
#define I2C1SCON_NACK                  (0x1   << 7  )
#define I2C1SCON_NACK_DIS              (0x0   << 7  )
#define I2C1SCON_NACK_EN               (0x1   << 7  )

/* I2C1SCON[STRETCHSCL] - Stretch SCL enable */
#define I2C1SCON_STRETCHSCL_BBA        (*(volatile unsigned long *) 0x42068518)
#define I2C1SCON_STRETCHSCL_MSK        (0x1   << 6  )
#define I2C1SCON_STRETCHSCL            (0x1   << 6  )
#define I2C1SCON_STRETCHSCL_DIS        (0x0   << 6  )
#define I2C1SCON_STRETCHSCL_EN         (0x1   << 6  )

/* I2C1SCON[EARLYTXR] - Early transmit request mode */
#define I2C1SCON_EARLYTXR_BBA          (*(volatile unsigned long *) 0x42068514)
#define I2C1SCON_EARLYTXR_MSK          (0x1   << 5  )
#define I2C1SCON_EARLYTXR              (0x1   << 5  )
#define I2C1SCON_EARLYTXR_DIS          (0x0   << 5  )
#define I2C1SCON_EARLYTXR_EN           (0x1   << 5  )

/* I2C1SCON[GCSBCLR] - General call status bit clear */
#define I2C1SCON_GCSBCLR_BBA           (*(volatile unsigned long *) 0x42068510)
#define I2C1SCON_GCSBCLR_MSK           (0x1   << 4  )
#define I2C1SCON_GCSBCLR               (0x1   << 4  )
#define I2C1SCON_GCSBCLR_DIS           (0x0   << 4  )
#define I2C1SCON_GCSBCLR_EN            (0x1   << 4  )

/* I2C1SCON[HGCEN] - Hardware general call enable */
#define I2C1SCON_HGCEN_BBA             (*(volatile unsigned long *) 0x4206850C)
#define I2C1SCON_HGCEN_MSK             (0x1   << 3  )
#define I2C1SCON_HGCEN                 (0x1   << 3  )
#define I2C1SCON_HGCEN_DIS             (0x0   << 3  )
#define I2C1SCON_HGCEN_EN              (0x1   << 3  )

/* I2C1SCON[GCEN] - General call enable */
#define I2C1SCON_GCEN_BBA              (*(volatile unsigned long *) 0x42068508)
#define I2C1SCON_GCEN_MSK              (0x1   << 2  )
#define I2C1SCON_GCEN                  (0x1   << 2  )
#define I2C1SCON_GCEN_DIS              (0x0   << 2  )
#define I2C1SCON_GCEN_EN               (0x1   << 2  )

