koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* I2C1SCON[ADR10EN] - Enabled 10-bit addressing */
#define I2C1SCON_ADR10EN_BBA           (*(volatile unsigned long *) 0x42068504)
#define I2C1SCON_ADR10EN_MSK           (0x1   << 1  )
#define I2C1SCON_ADR10EN               (0x1   << 1  )
#define I2C1SCON_ADR10EN_DIS           (0x0   << 1  )
#define I2C1SCON_ADR10EN_EN            (0x1   << 1  )

/* I2C1SCON[SLVEN] - Slave enable */
#define I2C1SCON_SLVEN_BBA             (*(volatile unsigned long *) 0x42068500)
#define I2C1SCON_SLVEN_MSK             (0x1   << 0  )
#define I2C1SCON_SLVEN                 (0x1   << 0  )
#define I2C1SCON_SLVEN_DIS             (0x0   << 0  )
#define I2C1SCON_SLVEN_EN              (0x1   << 0  )

/* Reset Value for I2C1SSTA*/
#define I2C1SSTA_RVAL                  0x1 

/* I2C1SSTA[START] - Start and matching address */
#define I2C1SSTA_START_BBA             (*(volatile unsigned long *) 0x420685B8)
#define I2C1SSTA_START_MSK             (0x1   << 14 )
#define I2C1SSTA_START                 (0x1   << 14 )
#define I2C1SSTA_START_CLR             (0x0   << 14 )
#define I2C1SSTA_START_SET             (0x1   << 14 )

/* I2C1SSTA[REPSTART] - Repeated start and matching address */
#define I2C1SSTA_REPSTART_BBA          (*(volatile unsigned long *) 0x420685B4)
#define I2C1SSTA_REPSTART_MSK          (0x1   << 13 )
#define I2C1SSTA_REPSTART              (0x1   << 13 )
#define I2C1SSTA_REPSTART_CLR          (0x0   << 13 )
#define I2C1SSTA_REPSTART_SET          (0x1   << 13 )

/* I2C1SSTA[IDMAT] - Device ID matched */
#define I2C1SSTA_IDMAT_MSK             (0x3   << 11 )

/* I2C1SSTA[STOP] - Stop after start and matching address */
#define I2C1SSTA_STOP_BBA              (*(volatile unsigned long *) 0x420685A8)
#define I2C1SSTA_STOP_MSK              (0x1   << 10 )
#define I2C1SSTA_STOP                  (0x1   << 10 )
#define I2C1SSTA_STOP_CLR              (0x0   << 10 )
#define I2C1SSTA_STOP_SET              (0x1   << 10 )

/* I2C1SSTA[GCID] - General ID */
#define I2C1SSTA_GCID_MSK              (0x3   << 8  )

/* I2C1SSTA[GCINT] - General call interrupt */
#define I2C1SSTA_GCINT_BBA             (*(volatile unsigned long *) 0x4206859C)
#define I2C1SSTA_GCINT_MSK             (0x1   << 7  )
#define I2C1SSTA_GCINT                 (0x1   << 7  )
#define I2C1SSTA_GCINT_CLR             (0x0   << 7  )
#define I2C1SSTA_GCINT_SET             (0x1   << 7  )

/* I2C1SSTA[SBUSY] - Slave busy */
#define I2C1SSTA_SBUSY_BBA             (*(volatile unsigned long *) 0x42068598)
#define I2C1SSTA_SBUSY_MSK             (0x1   << 6  )
#define I2C1SSTA_SBUSY                 (0x1   << 6  )
#define I2C1SSTA_SBUSY_CLR             (0x0   << 6  )
#define I2C1SSTA_SBUSY_SET             (0x1   << 6  )

/* I2C1SSTA[NOACK] - Ack not generated by the slave */
#define I2C1SSTA_NOACK_BBA             (*(volatile unsigned long *) 0x42068594)
#define I2C1SSTA_NOACK_MSK             (0x1   << 5  )
#define I2C1SSTA_NOACK                 (0x1   << 5  )
#define I2C1SSTA_NOACK_CLR             (0x0   << 5  )
#define I2C1SSTA_NOACK_SET             (0x1   << 5  )

/* I2C1SSTA[SRXOF] - Slave Receive FIFO overflow */
#define I2C1SSTA_SRXOF_BBA             (*(volatile unsigned long *) 0x42068590)
#define I2C1SSTA_SRXOF_MSK             (0x1   << 4  )
#define I2C1SSTA_SRXOF                 (0x1   << 4  )
#define I2C1SSTA_SRXOF_CLR             (0x0   << 4  )
#define I2C1SSTA_SRXOF_SET             (0x1   << 4  )

/* I2C1SSTA[SRXREQ] - Slave Receive request */
#define I2C1SSTA_SRXREQ_BBA            (*(volatile unsigned long *) 0x4206858C)
#define I2C1SSTA_SRXREQ_MSK            (0x1   << 3  )
#define I2C1SSTA_SRXREQ                (0x1   << 3  )
#define I2C1SSTA_SRXREQ_CLR            (0x0   << 3  )
#define I2C1SSTA_SRXREQ_SET            (0x1   << 3  )

/* I2C1SSTA[STXREQ] - Slave Transmit request */
#define I2C1SSTA_STXREQ_BBA            (*(volatile unsigned long *) 0x42068588)
#define I2C1SSTA_STXREQ_MSK            (0x1   << 2  )
#define I2C1SSTA_STXREQ                (0x1   << 2  )
#define I2C1SSTA_STXREQ_CLR            (0x0   << 2  )
#define I2C1SSTA_STXREQ_SET            (0x1   << 2  )

/* I2C1SSTA[STXUR] - Slave Transmit FIFO underflow */
#define I2C1SSTA_STXUR_BBA             (*(volatile unsigned long *) 0x42068584)
#define I2C1SSTA_STXUR_MSK             (0x1   << 1  )
#define I2C1SSTA_STXUR                 (0x1   << 1  )
#define I2C1SSTA_STXUR_CLR             (0x0   << 1  )
#define I2C1SSTA_STXUR_SET             (0x1   << 1  )

/* I2C1SSTA[STXFSEREQ] - Slave Tx FIFO Status or early request */
#define I2C1SSTA_STXFSEREQ_BBA         (*(volatile unsigned long *) 0x42068580)
#define I2C1SSTA_STXFSEREQ_MSK         (0x1   << 0  )
#define I2C1SSTA_STXFSEREQ             (0x1   << 0  )
#define I2C1SSTA_STXFSEREQ_CLR         (0x0   << 0  )
#define I2C1SSTA_STXFSEREQ_SET         (0x1   << 0  )

/* Reset Value for I2C1SRX*/
#define I2C1SRX_RVAL                   0x0 

/* I2C1SRX[I2CSRX] - Slave receive register */
#define I2C1SRX_I2CSRX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1STX*/
#define I2C1STX_RVAL                   0x0 

/* I2C1STX[I2CSTX] - Slave transmit register */
#define I2C1STX_I2CSTX_MSK             (0xFF  << 0  )

/* Reset Value for I2C1ALT*/
#define I2C1ALT_RVAL                   0x0 

/* I2C1ALT[ALT] - Slave Alt */
#define I2C1ALT_ALT_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID0*/
#define I2C1ID0_RVAL                   0x0 

/* I2C1ID0[ID0] - Slave device ID 0 */
#define I2C1ID0_ID0_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID1*/
#define I2C1ID1_RVAL                   0x0 

/* I2C1ID1[ID1] - Slave device ID 1 */
#define I2C1ID1_ID1_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID2*/
#define I2C1ID2_RVAL                   0x0 

/* I2C1ID2[ID2] - Slave device ID 2 */
#define I2C1ID2_ID2_MSK                (0xFF  << 0  )

/* Reset Value for I2C1ID3*/
#define I2C1ID3_RVAL                   0x0 

/* I2C1ID3[ID3] - Slave device ID 3 */
#define I2C1ID3_ID3_MSK                (0xFF  << 0  )

/* Reset Value for I2C1FSTA*/
#define I2C1FSTA_RVAL                  0x0 

