koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* MDIEN[MD_PHYNI] -  */
#define MDIEN_MD_PHYNI_BBA             (*(volatile unsigned long *) 0x420B839C)
#define MDIEN_MD_PHYNI_MSK             (0x1   << 7  )
#define MDIEN_MD_PHYNI                 (0x1   << 7  )
#define MDIEN_MD_PHYNI_DIS             (0x0   << 7  )
#define MDIEN_MD_PHYNI_EN              (0x1   << 7  )

/* MDIEN[MD_PHYMI] -  */
#define MDIEN_MD_PHYMI_BBA             (*(volatile unsigned long *) 0x420B8398)
#define MDIEN_MD_PHYMI_MSK             (0x1   << 6  )
#define MDIEN_MD_PHYMI                 (0x1   << 6  )
#define MDIEN_MD_PHYMI_DIS             (0x0   << 6  )
#define MDIEN_MD_PHYMI_EN              (0x1   << 6  )

/* MDIEN[MD_DEVNI] -  */
#define MDIEN_MD_DEVNI_BBA             (*(volatile unsigned long *) 0x420B8394)
#define MDIEN_MD_DEVNI_MSK             (0x1   << 5  )
#define MDIEN_MD_DEVNI                 (0x1   << 5  )
#define MDIEN_MD_DEVNI_DIS             (0x0   << 5  )
#define MDIEN_MD_DEVNI_EN              (0x1   << 5  )

/* MDIEN[MD_DEVMI] -  */
#define MDIEN_MD_DEVMI_BBA             (*(volatile unsigned long *) 0x420B8390)
#define MDIEN_MD_DEVMI_MSK             (0x1   << 4  )
#define MDIEN_MD_DEVMI                 (0x1   << 4  )
#define MDIEN_MD_DEVMI_DIS             (0x0   << 4  )
#define MDIEN_MD_DEVMI_EN              (0x1   << 4  )

/* MDIEN[MD_RDFI] -  */
#define MDIEN_MD_RDFI_BBA              (*(volatile unsigned long *) 0x420B838C)
#define MDIEN_MD_RDFI_MSK              (0x1   << 3  )
#define MDIEN_MD_RDFI                  (0x1   << 3  )
#define MDIEN_MD_RDFI_DIS              (0x0   << 3  )
#define MDIEN_MD_RDFI_EN               (0x1   << 3  )

/* MDIEN[MD_INCFI] -  */
#define MDIEN_MD_INCFI_BBA             (*(volatile unsigned long *) 0x420B8388)
#define MDIEN_MD_INCFI_MSK             (0x1   << 2  )
#define MDIEN_MD_INCFI                 (0x1   << 2  )
#define MDIEN_MD_INCFI_DIS             (0x0   << 2  )
#define MDIEN_MD_INCFI_EN              (0x1   << 2  )

/* MDIEN[MD_ADRI] -  */
#define MDIEN_MD_ADRI_BBA              (*(volatile unsigned long *) 0x420B8384)
#define MDIEN_MD_ADRI_MSK              (0x1   << 1  )
#define MDIEN_MD_ADRI                  (0x1   << 1  )
#define MDIEN_MD_ADRI_DIS              (0x0   << 1  )
#define MDIEN_MD_ADRI_EN               (0x1   << 1  )

/* MDIEN[MD_WRFI] -  */
#define MDIEN_MD_WRFI_BBA              (*(volatile unsigned long *) 0x420B8380)
#define MDIEN_MD_WRFI_MSK              (0x1   << 0  )
#define MDIEN_MD_WRFI                  (0x1   << 0  )
#define MDIEN_MD_WRFI_DIS              (0x0   << 0  )
#define MDIEN_MD_WRFI_EN               (0x1   << 0  )

/* Reset Value for MDPIN*/
#define MDPIN_RVAL                     0x0 

/* MDPIN[MD_PIN] -  */
#define MDPIN_MD_PIN_MSK               (0x1F  << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        PLA                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief PLA (pADI_PLA)
  */

typedef struct {                            /*!< pADI_PLA Structure                     */
  __IO uint32_t  PLA_ELEM[32];              /*!< ELEMx Configuration Register          */
  __IO uint16_t  PLA_CLK;                   /*!< PLA Clock Select                      */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PLA_IRQ0;                  /*!< Interrupt Register for Block 0 and 1  */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PLA_IRQ1;                  /*!< Interrupt Register for Block 2 and 3  */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  PLA_ADC;                   /*!< ADC Configuration Register            */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PLA_DIN0;                  /*!< AMBA Bus Data Input for Block 0 and 1 */
  __I  uint16_t  RESERVED4[3];
  __IO uint16_t  PLA_DOUT0;                 /*!< AMBA Bus Data Output for Block 0 and 1 */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PLA_DOUT1;                 /*!< AMBA Bus Data Output for Block 2 and 3 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PLA_LCK;                   /*!< Write lock Register. Can only be set once every reset */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PLA_PROBE_I2C;             /*!< PLA GPIO INPUT can be switched to probe I2C SCL/SDA */
} ADI_PLA_TypeDef;

/* Reset Value for PLA_ELEM*/
#define PLA_ELEM_RVAL                  0x0 

/* PLA_ELEM[MUX0] - Even element feedback selection (in respective block) */
#define PLA_ELEM_MUX0_MSK              (0x3   << 9  )
#define PLA_ELEM_MUX0_ELEM0            (0x0   << 9  ) /* Feedback from Element 0 (all except Element 0) / Input from other block (Element 0 only) */
#define PLA_ELEM_MUX0_ELEM2            (0x1   << 9  ) /* Feedback from Element 2  */
#define PLA_ELEM_MUX0_ELEM4            (0x2   << 9  ) /* Feedback from Element 4  */
#define PLA_ELEM_MUX0_ELEM6            (0x3   << 9  ) /* Feedback from Element 6  */

/* PLA_ELEM[MUX1] - Odd element feedback selection (in respective block) */
#define PLA_ELEM_MUX1_MSK              (0x3   << 7  )
#define PLA_ELEM_MUX1_ELEM1            (0x0   << 7  ) /* Feedback from Element 1  */
#define PLA_ELEM_MUX1_ELEM3            (0x1   << 7  ) /* Feedback from Element 3  */
#define PLA_ELEM_MUX1_ELEM5            (0x2   << 7  ) /* Feedback from Element 5  */
#define PLA_ELEM_MUX1_ELEM7            (0x3   << 7  ) /* Feedback from Element 7  */

/* PLA_ELEM[MUX2] - Select between correspondng bit from PLA_DINx register or even feedback mux */
#define PLA_ELEM_MUX2_BBA              (*(volatile unsigned long *) 0x420B0018)
#define PLA_ELEM_MUX2_MSK              (0x1   << 6  )
#define PLA_ELEM_MUX2                  (0x1   << 6  )
#define PLA_ELEM_MUX2_MMR              (0x0   << 6  ) /* PLA_DINx input           */
#define PLA_ELEM_MUX2_EVEN             (0x1   << 6  ) /* Even feedback mux        */

/* PLA_ELEM[MUX3] - Select between GPIO Bus input or odd feedback input (for Elements 16-31 odd feedback is always selected) */
#define PLA_ELEM_MUX3_BBA              (*(volatile unsigned long *) 0x420B0014)
#define PLA_ELEM_MUX3_MSK              (0x1   << 5  )
#define PLA_ELEM_MUX3                  (0x1   << 5  )
#define PLA_ELEM_MUX3_ODD              (0x0   << 5  ) /* odd feedback mux         */
#define PLA_ELEM_MUX3_GPIO             (0x1   << 5  ) /* GPIO input               */

