koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/********************  Reset Value for registers  *****************************/
#define GPIO_CON_RVAL             (0U)
#define GPIO_OE_RVAL              (0U)
#define GPIO_PUL_RVAL             (0U)
#define GPIO_IE_RVAL              (0U)
#define GPIO_IN_RVAL              (0U)
#define GPIO_OUT_RVAL             (0U)
#define GPIO_SET_RVAL             (0U)
#define GPIO_CLR_RVAL             (0U)
#define GPIO_TGL_RVAL             (0U)
#define GPIO_ODE_RVAL             (0U)

/********************  Bit definition for GPCON register  *********************/
#define GPIO_CON(af, pin)         (((uint16_t)(af) & 3U) << ((pin) << 1U))

/********************  Bit definition for GPOE register  **********************/
#define GPIO_OE(mode, pin)        ((uint8_t)(((mode) & 1U) << (pin)))

/********************  Bit definition for GPPUL register  *********************/
#define GPIO_PUL(mode, pin)       ((uint8_t)(((mode) & 1U) << (pin)))

/********************  Bit definition for GPIE register  **********************/
#define GPIO_IE(mode, pin)        ((uint8_t)(((mode) & 1U) << (pin)))

/********************  Bit definition for GPSET register  *********************/
#define GPIO_SET(pin)             ((uint8_t)(1U << (pin)))

/********************  Bit definition for GPCLR register  *********************/
#define GPIO_CLR(pin)             ((uint8_t)(1U << (pin)))

/********************  Bit definition for GPTGL register  *********************/
#define GPIO_TGL(pin)             ((uint8_t)(1U << (pin)))

/********************  Bit definition for GPODE register  *********************/
#define GPIO_ODE(mode, pin)       ((uint8_t)(((mode) & 1U) << (pin)))


// ------------------------------------------------------------------------------------------------
// -----                                        PWM                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief PWM (pADI_PWM)
  */

typedef struct {                            /*!< pADI_PWM Structure                     */
  __IO uint16_t  PWMCON0;                   /*!< PWM control register                  */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PWMCON1;                   /*!< ADC conversion start and trip control register */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PWMICLR;                   /*!< Hardware trip configuration register  */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  PWM0COM0;                  /*!< Compare Register 0 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PWM0COM1;                  /*!< Compare Register 1 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  PWM0COM2;                  /*!< Compare Register 2 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PWM0LEN;                   /*!< Period value register for PWM0 and PWM1 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PWM1COM0;                  /*!< Compare Register 0 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PWM1COM1;                  /*!< Compare Register 1 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  PWM1COM2;                  /*!< Compare Register 2 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  PWM1LEN;                   /*!< Period value register for PWM2 and PWM3 */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  PWM2COM0;                  /*!< Compare Register 0 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  PWM2COM1;                  /*!< Compare Register 1 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  PWM2COM2;                  /*!< Compare Register 2 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  PWM2LEN;                   /*!< Period value register for PWM4 and PWM5 */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  PWM3COM0;                  /*!< Compare Register 0 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  PWM3COM1;                  /*!< Compare Register 1 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  PWM3COM2;                  /*!< Compare Register 2 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  PWM3LEN;                   /*!< Period value register for PWM6 and PWM7 */
} ADI_PWM_TypeDef;

/* Reset Value for PWMCON0*/
#define PWMCON0_RVAL                   0x12 

/* PWMCON0[SYNC] - Set to enable PWM synchronization from the SYNC pin of the PWM */
#define PWMCON0_SYNC_BBA               (*(volatile unsigned long *) 0x4248003C)
#define PWMCON0_SYNC_MSK               (0x1   << 15 )
#define PWMCON0_SYNC                   (0x1   << 15 )
#define PWMCON0_SYNC_DIS               (0x0   << 15 ) /* Ignore transition from the SYNC pin */
#define PWMCON0_SYNC_EN                (0x1   << 15 ) /* All PWM counters are reset on the next clock cycle after detection of a falling edge from SYNC pin */

/* PWMCON0[PWM7INV] - Set to invert PWM7 output */
#define PWMCON0_PWM7INV_BBA            (*(volatile unsigned long *) 0x42480038)
#define PWMCON0_PWM7INV_MSK            (0x1   << 14 )
#define PWMCON0_PWM7INV                (0x1   << 14 )
#define PWMCON0_PWM7INV_DIS            (0x0   << 14 )
#define PWMCON0_PWM7INV_EN             (0x1   << 14 )

/* PWMCON0[PWM5INV] - Set to invert PWM5 output */
#define PWMCON0_PWM5INV_BBA            (*(volatile unsigned long *) 0x42480034)
#define PWMCON0_PWM5INV_MSK            (0x1   << 13 )
#define PWMCON0_PWM5INV                (0x1   << 13 )
#define PWMCON0_PWM5INV_DIS            (0x0   << 13 )
#define PWMCON0_PWM5INV_EN             (0x1   << 13 )

/* PWMCON0[PWM3INV] - Set to invert PWM3 output */
#define PWMCON0_PWM3INV_BBA            (*(volatile unsigned long *) 0x42480030)
#define PWMCON0_PWM3INV_MSK            (0x1   << 12 )
#define PWMCON0_PWM3INV                (0x1   << 12 )
#define PWMCON0_PWM3INV_DIS            (0x0   << 12 )
#define PWMCON0_PWM3INV_EN             (0x1   << 12 )

/* PWMCON0[PWM1INV] - Set to invert PWM1 output */
#define PWMCON0_PWM1INV_BBA            (*(volatile unsigned long *) 0x4248002C)
#define PWMCON0_PWM1INV_MSK            (0x1   << 11 )
#define PWMCON0_PWM1INV                (0x1   << 11 )
#define PWMCON0_PWM1INV_DIS            (0x0   << 11 )
#define PWMCON0_PWM1INV_EN             (0x1   << 11 )

/* PWMCON0[PWMIEN] - Set to enable interrupts for PWM */
#define PWMCON0_PWMIEN_BBA             (*(volatile unsigned long *) 0x42480028)
#define PWMCON0_PWMIEN_MSK             (0x1   << 10 )
#define PWMCON0_PWMIEN                 (0x1   << 10 )
#define PWMCON0_PWMIEN_DIS             (0x0   << 10 )
#define PWMCON0_PWMIEN_EN              (0x1   << 10 )

/* PWMCON0[ENA] - When HOFF=0 and HMODE=1 this serves as enable for Pair 0 and 1 */
#define PWMCON0_ENA_BBA                (*(volatile unsigned long *) 0x42480024)
#define PWMCON0_ENA_MSK                (0x1   << 9  )
#define PWMCON0_ENA                    (0x1   << 9  )
#define PWMCON0_ENA_DIS                (0x0   << 9  ) /* Disable Pair 0 and 1     */
#define PWMCON0_ENA_EN                 (0x1   << 9  ) /* Enable Pair 0 and 1      */

/* PWMCON0[PWMCMP] - PWM Clock prescaler. Sets HCLK divider. */
#define PWMCON0_PWMCMP_MSK             (0x7   << 6  )
#define PWMCON0_PWMCMP_DIV2            (0x0   << 6  ) /* HCLK/2                   */
#define PWMCON0_PWMCMP_DIV4            (0x1   << 6  ) /* HCLK/4                   */
#define PWMCON0_PWMCMP_DIV8            (0x2   << 6  ) /* HCLK/8                   */
#define PWMCON0_PWMCMP_DIV16           (0x3   << 6  ) /* HCLK/16                  */
#define PWMCON0_PWMCMP_DIV32           (0x4   << 6  ) /* HCLK/32                  */
#define PWMCON0_PWMCMP_DIV64           (0x5   << 6  ) /* HCLK/64                  */
#define PWMCON0_PWMCMP_DIV128          (0x6   << 6  ) /* HCLK/128                 */
#define PWMCON0_PWMCMP_DIV256          (0x7   << 6  ) /* HCLK/256                 */

/* PWMCON0[POINV] - Set to invert PWM outputs for Pair 0 and 1 when PWM is in H-bridge mode */
#define PWMCON0_POINV_BBA              (*(volatile unsigned long *) 0x42480014)
#define PWMCON0_POINV_MSK              (0x1   << 5  )
#define PWMCON0_POINV                  (0x1   << 5  )
#define PWMCON0_POINV_DIS              (0x0   << 5  )
#define PWMCON0_POINV_EN               (0x1   << 5  )

/* PWMCON0[HOFF] - Set to turn off the high-side for Pair 0 and 1 when PWM is in H-bridge mode */
#define PWMCON0_HOFF_BBA               (*(volatile unsigned long *) 0x42480010)
#define PWMCON0_HOFF_MSK               (0x1   << 4  )
#define PWMCON0_HOFF                   (0x1   << 4  )
#define PWMCON0_HOFF_DIS               (0x0   << 4  )
#define PWMCON0_HOFF_EN                (0x1   << 4  )

/* PWMCON0[LCOMP] - Signal to load a new set of compare register values. In standard mode, this bit is cleared when the new values are loaded in the compare registers for all the channels. In H-bridge mode this bit does not get cleared, but the user must write a value of 1 to this bit in order for the compare registers to be loaded */
#define PWMCON0_LCOMP_BBA              (*(volatile unsigned long *) 0x4248000C)
#define PWMCON0_LCOMP_MSK              (0x1   << 3  )
#define PWMCON0_LCOMP                  (0x1   << 3  )
#define PWMCON0_LCOMP_DIS              (0x0   << 3  ) /* Use the values previously store in the compare and length registers */
#define PWMCON0_LCOMP_EN               (0x1   << 3  ) /* Load the internal compare registers with values stored in the PWMxCOMx and PWMxLEN registers */

/* PWMCON0[DIR] - Direction control when PWM is in H-bridge mode */
#define PWMCON0_DIR_BBA                (*(volatile unsigned long *) 0x42480008)
#define PWMCON0_DIR_MSK                (0x1   << 2  )
#define PWMCON0_DIR                    (0x1   << 2  )
#define PWMCON0_DIR_DIS                (0x0   << 2  ) /* PWM2 and PWM3 act as output signals while PWM0 and PWM1 are held low */
#define PWMCON0_DIR_EN                 (0x1   << 2  ) /* PWM0 and PWM1 act as output signals while PWM2 and PWM3 are held low */

/* PWMCON0[HMODE] - Set to enable H-bridge mode */
#define PWMCON0_HMODE_BBA              (*(volatile unsigned long *) 0x42480004)
#define PWMCON0_HMODE_MSK              (0x1   << 1  )
#define PWMCON0_HMODE                  (0x1   << 1  )
#define PWMCON0_HMODE_DIS              (0x0   << 1  )
#define PWMCON0_HMODE_EN               (0x1   << 1  )

/* PWMCON0[PWMEN] - Master enable for PWM */
#define PWMCON0_PWMEN_BBA              (*(volatile unsigned long *) 0x42480000)
#define PWMCON0_PWMEN_MSK              (0x1   << 0  )
#define PWMCON0_PWMEN                  (0x1   << 0  )
#define PWMCON0_PWMEN_DIS              (0x0   << 0  ) /* Disable all PWM outputs  */
#define PWMCON0_PWMEN_EN               (0x1   << 0  ) /* Enable all PWM outputs   */

/* Reset Value for PWMCON1*/
#define PWMCON1_RVAL                   0x0 

