koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* PWMCON1[TRIP_EN] - Set to enable PWM Trip functionality */
#define PWMCON1_TRIP_EN_BBA            (*(volatile unsigned long *) 0x42480098)
#define PWMCON1_TRIP_EN_MSK            (0x1   << 6  )
#define PWMCON1_TRIP_EN                (0x1   << 6  )
#define PWMCON1_TRIP_EN_DIS            (0x0   << 6  )
#define PWMCON1_TRIP_EN_EN             (0x1   << 6  )

/* Reset Value for PWMICLR*/
#define PWMICLR_RVAL                   0x0 

/* PWMICLR[TRIP] - Write a 1 to clear latched IRQPWMTrip interrupt. Returns 0 on reads. */
#define PWMICLR_TRIP_BBA               (*(volatile unsigned long *) 0x42480110)
#define PWMICLR_TRIP_MSK               (0x1   << 4  )
#define PWMICLR_TRIP                   (0x1   << 4  )
#define PWMICLR_TRIP_DIS               (0x0   << 4  )
#define PWMICLR_TRIP_EN                (0x1   << 4  )

/* PWMICLR[PWM3] - Write a 1 to clear latched IRQPWM3 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM3_BBA               (*(volatile unsigned long *) 0x4248010C)
#define PWMICLR_PWM3_MSK               (0x1   << 3  )
#define PWMICLR_PWM3                   (0x1   << 3  )
#define PWMICLR_PWM3_DIS               (0x0   << 3  )
#define PWMICLR_PWM3_EN                (0x1   << 3  )

/* PWMICLR[PWM2] - Write a 1 to clear latched IRQPWM2 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM2_BBA               (*(volatile unsigned long *) 0x42480108)
#define PWMICLR_PWM2_MSK               (0x1   << 2  )
#define PWMICLR_PWM2                   (0x1   << 2  )
#define PWMICLR_PWM2_DIS               (0x0   << 2  )
#define PWMICLR_PWM2_EN                (0x1   << 2  )

/* PWMICLR[PWM1] - Write a 1 to clear latched IRQPWM1 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM1_BBA               (*(volatile unsigned long *) 0x42480104)
#define PWMICLR_PWM1_MSK               (0x1   << 1  )
#define PWMICLR_PWM1                   (0x1   << 1  )
#define PWMICLR_PWM1_DIS               (0x0   << 1  )
#define PWMICLR_PWM1_EN                (0x1   << 1  )

/* PWMICLR[PWM0] - Write a 1 to clear latched IRQPWM0 interrupt. Returns 0 on reads. */
#define PWMICLR_PWM0_BBA               (*(volatile unsigned long *) 0x42480100)
#define PWMICLR_PWM0_MSK               (0x1   << 0  )
#define PWMICLR_PWM0                   (0x1   << 0  )
#define PWMICLR_PWM0_DIS               (0x0   << 0  )
#define PWMICLR_PWM0_EN                (0x1   << 0  )

/* Reset Value for PWM0COM0*/
#define PWM0COM0_RVAL                  0x0 

/* PWM0COM0[COM0] - Compare register 0 data */
#define PWM0COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0COM1*/
#define PWM0COM1_RVAL                  0x0 

/* PWM0COM1[COM1] - Compare register 1 data */
#define PWM0COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0COM2*/
#define PWM0COM2_RVAL                  0x0 

/* PWM0COM2[COM2] - Compare register 2 data */
#define PWM0COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0LEN*/
#define PWM0LEN_RVAL                   0x0 

/* PWM0LEN[LEN] - Period value */
#define PWM0LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM1COM0*/
#define PWM1COM0_RVAL                  0x0 

/* PWM1COM0[COM0] - Compare register 0 data */
#define PWM1COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1COM1*/
#define PWM1COM1_RVAL                  0x0 

/* PWM1COM1[COM1] - Compare register 1 data */
#define PWM1COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1COM2*/
#define PWM1COM2_RVAL                  0x0 

/* PWM1COM2[COM2] - Compare register 2 data */
#define PWM1COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1LEN*/
#define PWM1LEN_RVAL                   0x0 

/* PWM1LEN[LEN] - Period value */
#define PWM1LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM2COM0*/
#define PWM2COM0_RVAL                  0x0 

/* PWM2COM0[COM0] - Compare register 0 data */
#define PWM2COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2COM1*/
#define PWM2COM1_RVAL                  0x0 

/* PWM2COM1[COM1] - Compare register 1 data */
#define PWM2COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2COM2*/
#define PWM2COM2_RVAL                  0x0 

/* PWM2COM2[COM2] - Compare register 2 data */
#define PWM2COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2LEN*/
#define PWM2LEN_RVAL                   0x0 

/* PWM2LEN[LEN] - Period value */
#define PWM2LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM3COM0*/
#define PWM3COM0_RVAL                  0x0 

/* PWM3COM0[COM0] - Compare register 0 data */
#define PWM3COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3COM1*/
#define PWM3COM1_RVAL                  0x0 

/* PWM3COM1[COM1] - Compare register 1 data */
#define PWM3COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3COM2*/
#define PWM3COM2_RVAL                  0x0 

/* PWM3COM2[COM2] - Compare register 2 data */
#define PWM3COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3LEN*/
#define PWM3LEN_RVAL                   0x0 

/* PWM3LEN[LEN] - Period value */
#define PWM3LEN_LEN_MSK                (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        CLKCTL                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief clocking (pADI_CLKCTL)
  */

typedef struct {                            /*!< pADI_CLKCTL Structure                  */
  __IO uint16_t  CLKCON0;                   /*!< Misc clock settings register          */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  CLKCON1;                   /*!< Clock dividers register               */
  __I  uint16_t  RESERVED1[7];
  __IO uint16_t  CLKCON5;                   /*!< User clock gating control register    */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  CLKSTAT0;                  /*!< Clocking status                       */
} ADI_CLKCTL_TypeDef;

/* Reset Value for CLKCON0*/
#define CLKCON0_RVAL                   0x0 

/* CLKCON0[HFXTALIE] - High frequency crystal interrupt enable */
#define CLKCON0_HFXTALIE_BBA           (*(volatile unsigned long *) 0x4250003C)
#define CLKCON0_HFXTALIE_MSK           (0x1   << 15 )
#define CLKCON0_HFXTALIE               (0x1   << 15 )
#define CLKCON0_HFXTALIE_DIS           (0x0   << 15 ) /* An interrupt to the core will not be generated on a HFXTAL ok or HFXTAL nok */
#define CLKCON0_HFXTALIE_EN            (0x1   << 15 ) /* An interrupt to the core will be generated on a HFXTAL ok or HFXTAL nok */

/* CLKCON0[SPLLIE] - SPLL Interrupt enable */
#define CLKCON0_SPLLIE_BBA             (*(volatile unsigned long *) 0x42500034)
#define CLKCON0_SPLLIE_MSK             (0x1   << 13 )
#define CLKCON0_SPLLIE                 (0x1   << 13 )
#define CLKCON0_SPLLIE_DIS             (0x0   << 13 ) /* System PLL interrupt will not be generated */
#define CLKCON0_SPLLIE_EN              (0x1   << 13 ) /* System PLL interrupt will be generated */

/* CLKCON0[PLLMUX] - PLL source selection */
#define CLKCON0_PLLMUX_BBA             (*(volatile unsigned long *) 0x4250002C)
#define CLKCON0_PLLMUX_MSK             (0x1   << 11 )
#define CLKCON0_PLLMUX                 (0x1   << 11 )
#define CLKCON0_PLLMUX_HFOSC           (0x0   << 11 ) /* Internal oscillator is selected (HFOSC) */
#define CLKCON0_PLLMUX_HFXTAL          (0x1   << 11 ) /* External oscillator is selected (HFXTAL) */

/* CLKCON0[CLKOUT] - GPIO clk out select */
#define CLKCON0_CLKOUT_MSK             (0xF   << 4  )
#define CLKCON0_CLKOUT_ROOT            (0x0   << 4  ) /* Root Clock               */
#define CLKCON0_CLKOUT_LFOSC           (0x1   << 4  ) /* LFOSC (32 kHz)           */
#define CLKCON0_CLKOUT_HFOSC           (0x2   << 4  ) /* HFOSC (16 MHz)           */
#define CLKCON0_CLKOUT_CORE            (0x4   << 4  ) /* Core Clock               */
#define CLKCON0_CLKOUT_PCLK            (0x5   << 4  ) /* PCLK                     */
#define CLKCON0_CLKOUT_T0              (0xB   << 4  ) /* Timer 0 Clock            */
#define CLKCON0_CLKOUT_WUT             (0xC   << 4  ) /* Wake up Timer Clock      */
#define CLKCON0_CLKOUT_HFXTAL          (0xE   << 4  ) /* HFXTAL                   */

