koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* DAC4CON[EN] - DAC4 enable */
#define DAC4CON_EN_BBA                 (*(volatile unsigned long *) 0x43048210)
#define DAC4CON_EN_MSK                 (0x1   << 4  )
#define DAC4CON_EN                     (0x1   << 4  )

/* DAC4CON[RN] - DAC4 reference selection */
#define DAC4CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC4DAT*/
#define DAC4DAT_RVAL                   0x0 

/* DAC4DAT[DAT] - DAC4 data */
#define DAC4DAT_DAT_MSK                (0xFFF << 16 )

/* Reset Value for DAC5CON*/
#define DAC5CON_RVAL                   0x100 

/* DAC5CON[PD] - DAC5 power down */
#define DAC5CON_PD_BBA                 (*(volatile unsigned long *) 0x430482A0)
#define DAC5CON_PD_MSK                 (0x1   << 8  )
#define DAC5CON_PD                     (0x1   << 8  )

/* DAC5CON[EN] - DAC5 enable */
#define DAC5CON_EN_BBA                 (*(volatile unsigned long *) 0x43048290)
#define DAC5CON_EN_MSK                 (0x1   << 4  )
#define DAC5CON_EN                     (0x1   << 4  )

/* DAC5CON[RN] - DAC5 reference selection */
#define DAC5CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC5DAT*/
#define DAC5DAT_RVAL                   0x0 

/* DAC5DAT[DAT] - DAC5 data */
#define DAC5DAT_DAT_MSK                (0xFFF << 16 )

/* Reset Value for DAC6CON*/
#define DAC6CON_RVAL                   0x100 

/* DAC6CON[PD] - DAC6 power down */
#define DAC6CON_PD_BBA                 (*(volatile unsigned long *) 0x43048320)
#define DAC6CON_PD_MSK                 (0x1   << 8  )
#define DAC6CON_PD                     (0x1   << 8  )

/* DAC6CON[EN] - DAC6 enable */
#define DAC6CON_EN_BBA                 (*(volatile unsigned long *) 0x43048310)
#define DAC6CON_EN_MSK                 (0x1   << 4  )
#define DAC6CON_EN                     (0x1   << 4  )

/* DAC6CON[RN] - DAC6 reference selection */
#define DAC6CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC6DAT*/
#define DAC6DAT_RVAL                   0x0 

/* DAC6DAT[DAT] - DAC6 data */
#define DAC6DAT_DAT_MSK                (0xFFF << 16 )

/* Reset Value for DAC7CON*/
#define DAC7CON_RVAL                   0x100 

/* DAC7CON[PD] - DAC7 power down */
#define DAC7CON_PD_BBA                 (*(volatile unsigned long *) 0x430483A0)
#define DAC7CON_PD_MSK                 (0x1   << 8  )
#define DAC7CON_PD                     (0x1   << 8  )

/* DAC7CON[EN] - DAC7 enable */
#define DAC7CON_EN_BBA                 (*(volatile unsigned long *) 0x43048390)
#define DAC7CON_EN_MSK                 (0x1   << 4  )
#define DAC7CON_EN                     (0x1   << 4  )

/* DAC7CON[RN] - DAC7 reference selection */
#define DAC7CON_RN_MSK                 (0x3   << 0  )

/* Reset Value for DAC7DAT*/
#define DAC7DAT_RVAL                   0x0 

/* DAC7DAT[DAT] - DAC7 data */
#define DAC7DAT_DAT_MSK                (0xFFF << 16 )
// ------------------------------------------------------------------------------------------------
// -----                                        InBuf                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief InBuf (pADI_InBuf)
  */

typedef struct {                            /*!< pADI_InBuf Structure                   */
  __IO uint16_t  IBUFCON;                   /*!< InBuf control register                */
} ADI_InBuf_TypeDef;

/* Reset Value for IBUFCON*/
#define IBUFCON_RVAL                   0xF 

/* IBUFCON[IBUF_CHOP] - CHOPINBUF enable the chop per InBuf separately */
#define IBUFCON_IBUF_CHOP_MSK          (0x3   << 4  )
#define IBUFCON_IBUF_CHOP_OFF          (0x0   << 4  ) /* Chopping disabled on both buffers. */
#define IBUFCON_IBUF_CHOP_NSIDE        (0x1   << 4  ) /* Chopping enabled on N-side only. P-side Disabled. */
#define IBUFCON_IBUF_CHOP_PSIDE        (0x2   << 4  ) /* Chopping enabled on P-side only. N-side Disabled. */
#define IBUFCON_IBUF_CHOP_BOTH         (0x3   << 4  ) /* Chopping enabled on both buffers. */

/* IBUFCON[IBUF_PD] - Power down P/N InBuf separately */
#define IBUFCON_IBUF_PD_MSK            (0x3   << 2  )
#define IBUFCON_IBUF_PD_NONE           (0x0   << 2  ) /* Both sides powered on    */
#define IBUFCON_IBUF_PD_NSIDE          (0x1   << 2  ) /* only N side powered down */
#define IBUFCON_IBUF_PD_PSIDE          (0x2   << 2  ) /* only P side powered down */
#define IBUFCON_IBUF_PD_BOTH           (0x3   << 2  ) /* Both sides powered down  */

/* IBUFCON[IBUF_BYP] - Bypass P/N InBuf seperately */
#define IBUFCON_IBUF_BYP_MSK           (0x3   << 0  )
#define IBUFCON_IBUF_BYP_NONE          (0x0   << 0  ) /* Bypass none sided        */
#define IBUFCON_IBUF_BYP_NSIDE         (0x1   << 0  ) /* N side bypassed          */
#define IBUFCON_IBUF_BYP_PSIDE         (0x2   << 0  ) /* P side bypassed          */
#define IBUFCON_IBUF_BYP_BOTH          (0x3   << 0  ) /* Bypass both              */
// ------------------------------------------------------------------------------------------------
// -----                                        LV                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (pADI_LV)
  */

typedef struct {                            /*!< pADI_LV Structure                      */
  __IO uint16_t  LVID;                      /*!< Low voltage die ID                    */
} ADI_LV_TypeDef;

/* Reset Value for LVID*/
#define LVID_RVAL                      0x71 

/* LVID[LVID] - LVID comes from hardware coded logic */
#define LVID_LVID_MSK                  (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        LV_RST                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (pADI_LV_RST)
  */

typedef struct {                            /*!< pADI_LV_RST Structure                  */
  __IO uint16_t  LVRST;                     /*!< LV die reset configuration            */
} ADI_LV_RST_TypeDef;

/* Reset Value for LVRST*/
#define LVRST_RVAL                     0x0 

/* LVRST[RETAIN] - LV retains status after WDT and software reset */
#define LVRST_RETAIN_BBA               (*(volatile unsigned long *) 0x43058680)
#define LVRST_RETAIN_MSK               (0x1   << 0  )
#define LVRST_RETAIN                   (0x1   << 0  )
#define LVRST_RETAIN_EN                (0x0   << 0  ) /* LV die retains status after watchdog or software reset. */
#define LVRST_RETAIN_DIS               (0x1   << 0  ) /* LV die does not retain status after watchdog or software reset. */
// ------------------------------------------------------------------------------------------------
// -----                                        LV_INT                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_INT (pADI_LV_INT)
  */

typedef struct {                            /*!< pADI_LV_INT Structure                  */
  __IO uint16_t  INTCLR;                    /*!< Interrupt clear register              */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  INTSEL;                    /*!< Interrupt mask register               */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  INTSTA;                    /*!< Interrupt status register             */
} ADI_LV_INT_TypeDef;

/* Reset Value for INTCLR*/
#define INTCLR_RVAL                    0x0 

/* INTCLR[CLR_WRECC_ERR] - Write 1 to this bit to clear the write ECC error interrupt flag */
#define INTCLR_CLR_WRECC_ERR_BBA       (*(volatile unsigned long *) 0x4306009C)
#define INTCLR_CLR_WRECC_ERR_MSK       (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR           (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR_DIS       (0x0   << 7  )
#define INTCLR_CLR_WRECC_ERR_EN        (0x1   << 7  )

/* INTCLR[CLR_RDECC_ERR] - Write 1 to this bit to clear the read ECC error interrupt flag */
#define INTCLR_CLR_RDECC_ERR_BBA       (*(volatile unsigned long *) 0x43060098)
#define INTCLR_CLR_RDECC_ERR_MSK       (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR           (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR_DIS       (0x0   << 6  )
#define INTCLR_CLR_RDECC_ERR_EN        (0x1   << 6  )

/* INTCLR[CLR_ACOMP] - Write 1 to this bit to clear the analog compare interrupt flag */
#define INTCLR_CLR_ACOMP_BBA           (*(volatile unsigned long *) 0x4306008C)
#define INTCLR_CLR_ACOMP_MSK           (0x1   << 3  )
#define INTCLR_CLR_ACOMP               (0x1   << 3  )
#define INTCLR_CLR_ACOMP_DIS           (0x0   << 3  )
#define INTCLR_CLR_ACOMP_EN            (0x1   << 3  )

