koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
/* AFECOMP[INNEG] - Selects comparator negative input signal. */
#define AFECOMP_INNEG_MSK              (0x3   << 6  )
#define AFECOMP_INNEG_AVDD2            (0x0   << 6  ) /* AVDD/2                   */
#define AFECOMP_INNEG_AIN5             (0x1   << 6  ) /* AIN5                     */
#define AFECOMP_INNEG_DAC7             (0x2   << 6  ) /* DAC7                     */

/* AFECOMP[OUT] - Connects comparator output to interrupt logic. */
#define AFECOMP_OUT_MSK                (0x3   << 4  )
#define AFECOMP_OUT_DIS                (0x0   << 4  ) /* Do not connect output    */
#define AFECOMP_OUT_EN                 (0x1   << 4  ) /* Connect output to interrupt logic */

/* AFECOMP[INV] - Selects output logic state. */
#define AFECOMP_INV_BBA                (*(volatile unsigned long *) 0x430F070C)
#define AFECOMP_INV_MSK                (0x1   << 3  )
#define AFECOMP_INV                    (0x1   << 3  )
#define AFECOMP_INV_NO                 (0x0   << 3  ) /* Output will be high if +ve input is above -ve input. */
#define AFECOMP_INV_YES                (0x1   << 3  ) /* Output will be high if +ve input is below -ve input. */

/* AFECOMP[SPEED] - Selects comparator speed. */
#define AFECOMP_SPEED_MSK              (0x3   << 1  )
#define AFECOMP_SPEED_SPEED6           (0x0   << 1  ) /* 6.00us                   */
#define AFECOMP_SPEED_SPEED3           (0x1   << 1  ) /* 3.25us                   */
#define AFECOMP_SPEED_SPEED2           (0x2   << 1  ) /* 1.75us                   */
#define AFECOMP_SPEED_SPEED1           (0x3   << 1  ) /* 1.00us                   */

/* AFECOMP[HYS] - Enables comparator hysteresis */
#define AFECOMP_HYS_BBA                (*(volatile unsigned long *) 0x430F0700)
#define AFECOMP_HYS_MSK                (0x1   << 0  )
#define AFECOMP_HYS                    (0x1   << 0  )
#define AFECOMP_HYS_DIS                (0x0   << 0  ) /* Disable hysteresis       */
#define AFECOMP_HYS_EN                 (0x1   << 0  ) /* Enable  hysteresis       */
// ------------------------------------------------------------------------------------------------
// -----                                        nvic                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief nvic (pADI_nvic)
  */


/* Reset Value for ICTR*/
#define ICTR_RVAL                      0x0 

/* Reset Value for STCSR*/
#define STCSR_RVAL                     0x0 

/* Reset Value for STRVR*/
#define STRVR_RVAL                     0x0 

/* Reset Value for STCVR*/
#define STCVR_RVAL                     0x0 

/* Reset Value for STCR*/
#define STCR_RVAL                      0x0 

/* Reset Value for ISER0*/
#define ISER0_RVAL                     0x0 

/* Reset Value for ISER1*/
#define ISER1_RVAL                     0x0 

/* Reset Value for ICER0*/
#define ICER0_RVAL                     0x0 

/* Reset Value for ICER1*/
#define ICER1_RVAL                     0x0 

/* Reset Value for ISPR0*/
#define ISPR0_RVAL                     0x0 

/* Reset Value for ISPR1*/
#define ISPR1_RVAL                     0x0 

/* Reset Value for ICPR0*/
#define ICPR0_RVAL                     0x0 

/* Reset Value for ICPR1*/
#define ICPR1_RVAL                     0x0 

/* Reset Value for IABR0*/
#define IABR0_RVAL                     0x0 

/* Reset Value for IABR1*/
#define IABR1_RVAL                     0x0 

/* Reset Value for IPR0*/
#define IPR0_RVAL                      0x0 

/* Reset Value for IPR1*/
#define IPR1_RVAL                      0x0 

/* Reset Value for IPR2*/
#define IPR2_RVAL                      0x0 

/* Reset Value for IPR3*/
#define IPR3_RVAL                      0x0 

/* Reset Value for IPR4*/
#define IPR4_RVAL                      0x0 

/* Reset Value for IPR5*/
#define IPR5_RVAL                      0x0 

/* Reset Value for IPR6*/
#define IPR6_RVAL                      0x0 

/* Reset Value for IPR7*/
#define IPR7_RVAL                      0x0 

/* Reset Value for IPR8*/
#define IPR8_RVAL                      0x0 

/* Reset Value for IPR9*/
#define IPR9_RVAL                      0x0 

/* Reset Value for IPR10*/
#define IPR10_RVAL                     0x0 

/* Reset Value for IPR11*/
#define IPR11_RVAL                     0x0 

/* Reset Value for IPR12*/
#define IPR12_RVAL                     0x0 

/* Reset Value for IPR13*/
#define IPR13_RVAL                     0x0 

/* Reset Value for CPUID*/
#define CPUID_RVAL                     0x0 

/* Reset Value for ICSR*/
#define ICSR_RVAL                      0x0 

/* Reset Value for VTOR*/
#define VTOR_RVAL                      0x0 

/* Reset Value for AIRCR*/
#define AIRCR_RVAL                     0x0 

/* Reset Value for SCR*/
#define SCR_RVAL                       0x0 

/* SCR[SLEEPDEEP] - deep sleep flag for HIBERNATE mode */
#define SCR_SLEEPDEEP_MSK              (0x1   << 2  )
#define SCR_SLEEPDEEP                  (0x1   << 2  )
#define SCR_SLEEPDEEP_DIS              (0x0   << 2  )
#define SCR_SLEEPDEEP_EN               (0x1   << 2  )

/* SCR[SLEEPONEXIT] - Sleeps the core on exit from an ISR */
#define SCR_SLEEPONEXIT_MSK            (0x1   << 1  )
#define SCR_SLEEPONEXIT                (0x1   << 1  )
#define SCR_SLEEPONEXIT_DIS            (0x0   << 1  )
#define SCR_SLEEPONEXIT_EN             (0x1   << 1  )

/* Reset Value for CCR*/
#define CCR_RVAL                       0x0 

/* Reset Value for SHPR1*/
#define SHPR1_RVAL                     0x0 

/* Reset Value for SHPR2*/
#define SHPR2_RVAL                     0x0 

/* Reset Value for SHPR3*/
#define SHPR3_RVAL                     0x0 

/* Reset Value for SHCRS*/
#define SHCRS_RVAL                     0x0 

/* Reset Value for CFSR*/
#define CFSR_RVAL                      0x0 

/* Reset Value for HFSR*/
#define HFSR_RVAL                      0x0 

/* Reset Value for MMAR*/
#define MMAR_RVAL                      0x0 

/* Reset Value for BFAR*/
#define BFAR_RVAL                      0x0 

/* Reset Value for AFSR*/
#define AFSR_RVAL                      0x0 

/* Reset Value for STIR*/
#define STIR_RVAL                      0x0 


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/********************************************
** Miscellaneous Definitions               **
*********************************************/

