koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm322i.h
//iEiNr in EiCfg()
#define EXTINT0 0x0 
#define EXTINT1 0x1 
#define EXTINT2 0x2 
#define EXTINT3 0x3 
#define EXTINT4 0x4 
#define EXTINT5 0x5 
#define EXTINT6 0x6 
#define EXTINT7 0x7 
#define EXTINT8 0x8 

//iEnable in EiCfg()
#define INT_DIS 0x0
#define INT_EN  0x1

//iMode in EiCfg() 
#define INT_RISE  0x0
#define INT_FALL  0x1
#define INT_EDGES 0x2
#define INT_HIGH  0x3
#define INT_LOW   0x4

//Bit values.
#define BIT0     1
#define BIT1     2
#define BIT2     4
#define BIT3     8
#define BIT4     0x10
#define BIT5     0x20
#define BIT6     0x40
#define BIT7     0x80


/* ========================================================================== */
/* =============              Peripheral memory map             ============= */
/* ========================================================================== */

#define ADI_TMR0_ADDR                            0x40000000UL
#define ADI_TMR1_ADDR                            0x40000400UL
#define ADI_TMR2_ADDR                            0x40000800UL
#define ADI_ID_ADDR                              0x40002024UL
#define ADI_PWRCTL_ADDR                          0x40002400UL
#define ADI_RESET_ADDR                           0x40002408UL
#define ADI_INTERRUPT_ADDR                       0x40002420UL
#define ADI_WDT_ADDR                             0x40002580UL
#define ADI_WUT_ADDR                             0x40002500UL
#define ADI_I2C0_ADDR                            0x40003000UL
#define ADI_I2C1_ADDR                            0x40003400UL
#define ADI_UART_ADDR                            0x40005000UL
#define ADI_MDIO_ADDR                            0x40005C00UL
#define ADI_PLA_ADDR                             0x40005800UL
#define ADI_DMA_ADDR                             0x40010000UL
#define ADI_FEE_ADDR                             0x40018000UL
#define MMR_GPIO0_ADDR                           0x40020000UL
#define MMR_GPIO1_ADDR                           0x40020040UL
#define MMR_GPIO2_ADDR                           0x40020080UL
#define MMR_GPIO3_ADDR                           0x400200C0UL
#define MMR_GPIO4_ADDR                           0x40020100UL
#define MMR_GPIO5_ADDR                           0x40020240UL
#define ADI_PWM_ADDR                             0x40024000UL
#define ADI_CLKCTL_ADDR                          0x40028000UL
#define ADI_dma_ctl_ADDR                         0x40028100UL
#define ADI_SPI0_ADDR                            0x4002C000UL
#define ADI_SPI1_ADDR                            0x40030000UL
#define ADI_ADC_ADDR                             0x40082174UL
#define ADI_VDAC0_ADDR                           0x40082400UL
#define ADI_VDAC1_ADDR                           0x40082404UL
#define ADI_VDAC2_ADDR                           0x40082408UL
#define ADI_VDAC3_ADDR                           0x4008240CUL
#define ADI_VDAC4_ADDR                           0x40082410UL
#define ADI_VDAC5_ADDR                           0x40082414UL
#define ADI_VDAC6_ADDR                           0x40082418UL
#define ADI_VDAC7_ADDR                           0x4008241CUL
#define ADI_InBuf_ADDR                           0x40081400UL
#define ADI_LV_ADDR                              0x40082C30UL
#define ADI_LV_RST_ADDR                          0x40082C34UL
#define ADI_LV_INT_ADDR                          0x40083004UL
#define ADI_AFE_ADDR                             0x40087830UL


/* ========================================================================== */
/* =============             Peripheral declaration             ============= */
/* ========================================================================== */

#define pADI_TMR0                 ((ADI_TIMER_TypeDef     *)ADI_TMR0_ADDR)
#define pADI_TMR1                 ((ADI_TIMER_TypeDef     *)ADI_TMR1_ADDR)
#define pADI_TMR2                 ((ADI_TIMER_TypeDef     *)ADI_TMR2_ADDR)
#define pADI_ID                   ((ADI_ID_TypeDef        *)ADI_ID_ADDR)
#define pADI_PWRCTL               ((ADI_PWRCTL_TypeDef    *)ADI_PWRCTL_ADDR)
#define pADI_RESET                ((ADI_RESET_TypeDef     *)ADI_RESET_ADDR)
#define pADI_INTERRUPT            ((ADI_INTERRUPT_TypeDef *)ADI_INTERRUPT_ADDR)
#define pADI_WDT                  ((ADI_WDT_TypeDef       *)ADI_WDT_ADDR)
#define pADI_WUT                  ((ADI_WUT_TypeDef       *)ADI_WUT_ADDR)
#define pADI_I2C0                 ((ADI_I2C_TypeDef       *)ADI_I2C0_ADDR)
#define pADI_I2C1                 ((ADI_I2C_TypeDef       *)ADI_I2C1_ADDR)
#define pADI_UART                 ((ADI_UART_TypeDef      *)ADI_UART_ADDR)
#define pADI_MDIO                 ((ADI_MDIO_TypeDef      *)ADI_MDIO_ADDR)
#define pADI_PLA                  ((ADI_PLA_TypeDef       *)ADI_PLA_ADDR)
#define pADI_DMA                  ((ADI_DMA_TypeDef       *)ADI_DMA_ADDR)
#define pADI_FEE                  ((ADI_FEE_TypeDef       *)ADI_FEE_ADDR)
#define MMR_GPIO0                 ((MMR_GPIO_t            *)MMR_GPIO0_ADDR)
#define MMR_GPIO1                 ((MMR_GPIO_t            *)MMR_GPIO1_ADDR)
#define MMR_GPIO2                 ((MMR_GPIO_t            *)MMR_GPIO2_ADDR)
#define MMR_GPIO3                 ((MMR_GPIO_t            *)MMR_GPIO3_ADDR)
#define MMR_GPIO4                 ((MMR_GPIO_t            *)MMR_GPIO4_ADDR)
#define MMR_GPIO5                 ((MMR_GPIO_t            *)MMR_GPIO5_ADDR)
#define pADI_PWM                  ((ADI_PWM_TypeDef       *)ADI_PWM_ADDR)
#define pADI_CLKCTL               ((ADI_CLKCTL_TypeDef    *)ADI_CLKCTL_ADDR)
#define pADI_dma_ctl              ((ADI_dma_ctl_TypeDef   *)ADI_dma_ctl_ADDR)
#define pADI_SPI0                 ((ADI_SPI_TypeDef       *)ADI_SPI0_ADDR)
#define pADI_SPI1                 ((ADI_SPI_TypeDef       *)ADI_SPI1_ADDR)
#define pADI_ADC                  ((ADI_ADC_TypeDef       *)ADI_ADC_ADDR)
#define pADI_VDAC0                ((ADI_VDAC_TypeDef      *)ADI_VDAC0_ADDR)
#define pADI_VDAC1                ((ADI_VDAC_TypeDef      *)ADI_VDAC1_ADDR)
#define pADI_VDAC2                ((ADI_VDAC_TypeDef      *)ADI_VDAC2_ADDR)
#define pADI_VDAC3                ((ADI_VDAC_TypeDef      *)ADI_VDAC3_ADDR)
#define pADI_VDAC4                ((ADI_VDAC_TypeDef      *)ADI_VDAC4_ADDR)
#define pADI_VDAC5                ((ADI_VDAC_TypeDef      *)ADI_VDAC5_ADDR)
#define pADI_VDAC6                ((ADI_VDAC_TypeDef      *)ADI_VDAC6_ADDR)
#define pADI_VDAC7                ((ADI_VDAC_TypeDef      *)ADI_VDAC7_ADDR)
#define pADI_InBuf                ((ADI_InBuf_TypeDef     *)ADI_InBuf_ADDR)
#define pADI_LV                   ((ADI_LV_TypeDef        *)ADI_LV_ADDR)
#define pADI_LV_RST               ((ADI_LV_RST_TypeDef    *)ADI_LV_RST_ADDR)
#define pADI_LV_INT               ((ADI_LV_INT_TypeDef    *)ADI_LV_INT_ADDR)
#define pADI_IDAC0                ((ADI_IDAC_TypeDef      *)ADI_IDAC0_ADDR)
#define pADI_IDAC1                ((ADI_IDAC_TypeDef      *)ADI_IDAC1_ADDR)
#define pADI_IDAC2                ((ADI_IDAC_TypeDef      *)ADI_IDAC2_ADDR)
#define pADI_IDAC3                ((ADI_IDAC_TypeDef      *)ADI_IDAC3_ADDR)
#define pADI_AFE                  ((ADI_AFE_TypeDef       *)ADI_AFE_ADDR)

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group ADUCM322I */
/** @} */ /* End of group CMSIS */

#ifdef __cplusplus
}
#endif 


#endif  // ADUCM322I_H_
